# Массив частей речи для отзеркаливания

reflections = {
                         #----Личные местоимоения--------
    "я": "ты", "ты": "я",
    "мы": "вы", "вы": "мы",
    "меня": "тебя",  "тебя": "меня",
    "мне": "тебе","тебе": "мне",
    "мой": "твой", "твой": "мой",
    "моя": "твоя", "твоя": "моя",
    "мое": "твое", "твое": "мое",
    "наш": "ваш", "ваш": "наш",
    "мной": "тобой", "тобой": "мной",
    "себя": "тебя",
    "себе": "тебе",
    "собой": "тобой",
    "свое": "твое",

                         #------глаголы------------   

    "буду": "будешь", "будешь": "буду", 
    "хочу": "хочешь", "хочешь": "хочу",
    "хожу": "ходишь", "ходишь": "хожу",
    "думаю": "думаешь", "думаешь": "думаю",
    "пойду": "пойдешь", "пойдешь": "пойду",
    "смотрю": "смотришь", "смотришь": "смотрю",
    "делаю": "делаешь", "делаешь": "делаю",
} 

# ----------------------Список местоимений(пока просто список) 

# ----Личные местоимения 3-е лицо
# он, она, оно, они (+ оне)

# ----Вопросительные местримения 
# кто?, что?, какой?, каков?, чей?,  который?,  сколько?,  где?,  когда?,  куда?,  откуда?,  зачем?

# ----Указательные местримения
#этот, тот, такой, таков, тут, здесь, сюда, туда, оттуда, отсюда, тогда, поэтому,затем,

# ----Определительные местоимения
#весь, всякий, все, сам, самый, каждый, любой, другой, иной, всяческий, всюду, везде, всегда

# ----Отрицательные местоимения
#никто, ничто, некого, нечего, никакой, ничей, негде

# ----Неопределенные местоимения
#некто, нечто, некий, некоторый, несколько, кое-кто, кое-где, кое-что, кое-куда, какой-либо, сколько-нибудь, куда-нибудь, зачем-нибудь, чей-либо
